app/Http/Controllers/Auth/Api/AuthController.php

    public function createUser(Request $request)
    {
        try {
            //Validated
            $validateUser = Validator::make($request->all(),
            [
                'name' => 'required',
                'email' => 'required|email|unique:users,email',
                'password' => 'required'
            ]);

            if($validateUser->fails()){
                return response()->json([
                    'status' => false,
                    'message' => 'validation error',
                    'errors' => $validateUser->errors()
                ], 401);
            }

            $user = User::create([
                'name' => $request->name,
                'email' => $request->email,
                'password' => Hash::make($request->password)
            ]);
---
insert into `users` (`name`, `email`, `password`, `updated_at`, `created_at`) values ('lallll', 'hhhhhhhhhhh@gmial.com', '$2y$10$UwPEY/yeFKQ.nZAjb76g0O4Q6PkS78aldJ8euVxovRLLZ4vacp.06', '2023-01-09 03:56:49', '2023-01-09 03:56:49')

    public function loginUser(Request $request)
    {
        try {
            $validateUser = Validator::make($request->all(),
            [
                'email' => 'required|email',
                'password' => 'required'
            ]);

            if($validateUser->fails()){
                return response()->json([
                    'status' => false,
                    'message' => 'validation error',
                    'errors' => $validateUser->errors()
                ], 401);
            }

            if(!Auth::attempt($request->only(['email', 'password']))){
                return response()->json([
                    'status' => false,
                    'message' => 'Email & Password does not match with our record.',
                ], 401);
            }

            $user = User::where('email', $request->email)->first();
---
select * from `users` where `email` = 'hhhhhhhhhhh@gmial.com' limit 1