app/Http/Controllers/Backend/AdminController.php

    public function adminRegisterPost(Request $request){
        $request->validate([
            'name' => 'required|min:5,max:150',
            'email' => 'required|email|unique:admins,email',
            'password' => 'required|confirmed|min:5',
        ],[
            'password.min' => 'Need atlast 5 charecter',
        ]);

        $data = $request->all();
        $data['password'] = Hash::make($data['password']);

        $user = Admin::create($data);
---
insert into `admins` (`name`, `email`, `password`, `updated_at`, `created_at`) values ('Kabbya', 'admin@gmail.com', '$2y$10$LHRDtP.hXTLsM4et5dNhr./znhGcy1RirbMQp4LcAH1YZ6OZxmFw.', '2023-01-09 10:54:10', '2023-01-09 10:54:10')